Repository: GamemakerChina/GMS2_manual_en2ch
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: The above code will check to see which view is currently being drawn, and if it is view[0] it sets the draw target to a surface and draws all instances of the object "obj_Effect" before resetting the draw target again.
zh_cn: 上述代码将检测当前是哪个视野在绘制，如果是view[0] ，它将设置绘制目标到一个表面层，并在表面层上绘制“obj_Effect”所有实例 ，然后重置绘制目标。

source: The above code will check two arrays to see if they hold equivalent values, and if they do not then the code will copy the entire contents of the array "inventory_array" to the array "item_array".
zh_cn: 上述代码将会检测两个数组来查看它们是否承载了相等的值，如果不是，这段代码将会拷贝数组"inventory_array"的全部内容给数组"item_array"。

source: The above code will clear the particle emitter indexed in the variable "p_emit1".
zh_cn: 上述代码将会清空索引为变量“p_emit1”的粒子发射器。

source: The above code will create a new TCP socket then attempt to connect through that to the given IP address on port 6510.
zh_cn: 上述代码会新建一个TCP套接字然后尝试通过之去连接指定的IP地址的6510端口。

source: The above code will create a new array of 100 entries, each one set to the keyword noone, and then assign it to the variable "instance_array".
zh_cn: 上述代码将会创建一个具有100个元素的新书组，每个新数组会被赋予一个关键字noone，然后将整个数组赋给变量"instance_array"。

source: The above code will create an identity matrix and store its index in a variable for future use.
zh_cn: 上述代码将会创建一个单位矩阵并将其索引存入一个变量中以供日后使用。

source: The above code will delete the font indexed in the global variable "Font".
zh_cn: 上述代码会删除索引为全局变量“Font”的字体。

source: The above code will generate a 1D array held in the variable display_data containing the information about the displays, as well as create the variable display_num to hold the number of active displays found.
zh_cn: 上述代码将生成一个包含显示器信息的一维数组保存到变量 display_data，同时创建变量 display_num 保存找到的激活的显示器的数目。

source: The above code will get the 32bit colour value at the position of the mouse and then split it into its component values, storing them in variables.
zh_cn: 上述代码将获取鼠标位置的32位真颜色，提取它的分量值，储存到不同的变量上。

source: The above code will get the angle of direction from the instance to the mouse cursor, then get the difference between that angle and the current image_angle, using this value to slowly rotate towards the mouse.
zh_cn: 上述代码将会获得实例到鼠标光标的方向角，然后获得这个角度与当前的image_angle的差值，同时使用这个值缓慢地向鼠标方向旋转。

source: The above code will get the blue component of the colour constant "c_teal" and store the value in the variable "b_comp".
zh_cn: 上述代码获取常量 "c_teal"的蓝色值，并且将其储存到变量 "b_comp"中。

source: The above code will get the green component of the colour constant "c_teal" and store the value in the variable "g_comp".
zh_cn: 上述代码将会返回颜色常量“c_teal”的绿色分量，并将该值存储与变量“g_comp”中。

source: The above code will get the position of the application surface, as well as the absolute width and height in relation to the display window, and store them in four variables for future use.
zh_cn: 上述代码获取应用表面层的位置，以及相对于显示器或窗口的绝对长宽值，保存到四个变量上备用。

source: The above code will get the red component of the colour constant "c_teal" and store the value in the variable "r_comp".
zh_cn: 上述代码获取颜色常量 "c_teal"的红色分量，并且将其储存到变量 "r_comp"中。

source: The above code will lock the draw GUI event to the given width and height, scaling all components to fit the display, using that proportion.
zh_cn: 上述代码将锁定GUI绘制事件，以指定的宽度，使用那个比例缩放所有的分量以适应显示器。

source: The above code will loop through a 2D array and set each entry to -1.
zh_cn: 上述代码将会遍历该二维数组并将每一元素设为-1。

source: The above code will position the game window in the upper left corner of the browser or display (depending on the target module being used).
zh_cn: 上述代码将放置游戏窗口至浏览器或者显示器（根据正在使用的目标模块）的左上角。

source: The above code will resize the application surface to have a 1:1 ratio with the GUI layer.
zh_cn: 上述代码在GUI层上以1:1的比例重置应用表面层的大小。

source: The above code will resize the ds_grid indexed in the global variable "Grid" and then clear it so that each cell holds the value -1.
zh_cn: 上述代码将会重设索引为全局变量"Grid"的栅格结构的大小，并且接下来清空它以便每个单元个都承载值-1.

source: The above code will return the IP address of the given URL and store it in the variable "game_ip".
zh_cn: 上述代码将会返回所指定的URL的IP地址并将其存入变量“game_ip”中。

source: The above code will set an advert to display at the bottom left-hand corner of the display.
zh_cn: 上述代码在显示器底部左下角设置并显示一个广告。

source: The above code will set an advert to display at the top right-hand of the display.
zh_cn: 上述代码将在显示器右上角设置并显示一个广告。

source: The above code will set the anti-aliasing level to 8 if supported and switch v-sync to on.
zh_cn: 上述代码将设置抗锯齿等级为8，并开启垂直同步。

source: The above code will set the game window to occupy the whole display area (either the browser or the screen, depending on the target platform).
zh_cn: 上述代码将设置游戏窗口覆盖整个显示器区域（可以是浏览器或者屏幕，取决于目标平台）。

source: The above code will set the minimum and maximum width and height for the game window.
zh_cn: 上述代码将为游戏窗口设定最大宽高。

source: The above code will set the render target 0 to the surface ID indexed in the variable "surf".
zh_cn: 上述代码将渲染目标0到变量“surf”索引的表面层上。

source: The above code will set the timeout for the network connection to 1000ms and tell GameMaker Studio 2 not to block on connect.
zh_cn: 上述代码会设置网络连接超时限制为1000毫秒并告知GameMaker Studio 2不阻止连接。

source: The above code will skip back to the beginning of the loop if the array[i] value is already an empty string.
zh_cn: 上述代码将判断array[i]的值，如果是一个空字符，它将跳回到循环的开始。

source: The above code will store the current window height in the variable "hh".
zh_cn: 上述代码将获取当前窗口的高度，保存到变量"hh"中。

source: The above code will store the current window width in the variable "ww".
zh_cn: 上述代码将保存当前窗口的宽度到变量“ww”中。

source: The above code will store the d3d device pointer in a variable.
zh_cn: 上述代码在一个变量中保存d3d设备的指针。

source: The above code will store the game window id in a variable.
zh_cn: 上述代码将游戏窗口id存入一个变量。

source: The above code will store the height of the surface indexed in the variable "surf" in the variable "sh".
zh_cn: 上述代码将在变量sh中储存索引变量为surf的表面图层的高度。

source: The above code will store the width of the surface indexed in the variable "surf" in the variable "sw".
zh_cn: 上述代码将在变量sw中储存索引变量为surf的表面图层的宽度。

source: The above code will switch off the automatic drawing of the application surface.
zh_cn: 上述代码将切换应用表面层的自动绘制为假。

source: The above code will try and create a server using TCP through port 32.
zh_cn: 上述代码将会尝试使用TCP协议通过端口32创建一个服务端。

source: The above code will try and create a server using TCP through port 6510.
zh_cn: 上述代码将会尝试使用TCP协议通过端口6510创建一个服务端。

source: The above code would center the mouse in the game display.
zh_cn: 上述代码将鼠标放置在显示器中央。

source: The above code would center the mouse in the game window.
zh_cn: 上述代码将鼠标在游戏窗口中居中放置。

source: The above will create two arrays as local variables, the first already populated with 5 elements and the second as an empty array ready to have values added.
zh_cn: 上面将创建两个数组作为局部变量， 第一个已填充了5个元素，第二个作为空数组，准备用来添加值。

source: The action Execute Script has too many or too few arguments for the given script being called
zh_cn: 动作 执行脚本 有过多或过少的参数用于调用给定的脚本

source: The actual sequence of events is as follows:
zh_cn: 实际的事件序列如下所示：

source: The actual structure of the program can vary greatly, depending on the functions it uses, but broken down to basics it just looks like this:
zh_cn: 程序的结构可以千差万别，但最基本的通常都像下面这样：

source: The addon could not be downloaded from the marketplace
zh_cn: 无法在市场上下载该附加组件

source: The addon could not be found on the marketplace
zh_cn: 无法在市场上找到该附加组件

source: The advantage of using BITS as a true/false state, is they you can set several flags in one operation, something you simply couldn't do with a normal Boolean value.
zh_cn: 使用位作为真/假状态的一个优点是，有些时候你不能简单的设置一个一般的布尔值，此时，你可以在一个操作里设置多个标志。

source: The amount of memory in gigabytes to dedicate to this game on Xbox One X \nAllows games to take advantage of full xbox one x available memory or request less to improve load times
zh_cn: 在 Xbox One X 上专用于此游戏的内存量（GB）\n允许游戏使用完整的 xbox one x 可用内存或请求更少的内存以改善加载时间

source: The amount of memory in megabytes to dedicate to the shared CPU/GPU memory pool \nMaximum allocation must be shared between both pools
zh_cn: 专用于共享CPU / GPU内存池的内存量（以兆字节为单位）\n必须在两个池之间共享最大分配

source: The amount of memory in megabytes to dedicate to the shared GPU memory pool \nMaximum allocation must be shared between both pools
zh_cn: 专用于共享GPU内存池的内存量（以兆字节为单位）\n必须在两个池之间共享最大分配

source: The amount of padding between two columns in a chain
zh_cn: 一条工作链中两列的间隔量

source: The amount of padding between two rows in a chain
zh_cn: 一条工作链中两行的间隔量

source: The amount of spacing for depth between layers
zh_cn: 层间深度的间距

source: The anonymous statistics allow us to get a handle on what targets we need to focus on as well as giving developers a look at to where their target audience is.
zh_cn: 匿名统计使我们能够得到一个我们所需要关注目标的处理(handle)，以及让开发人员能看到他们的目标用户在哪。

source: The answer is definitely "yes, you should".
zh_cn: 答案明显是“是的，你应该”。

source: The answer is defnitely "yes, you should".
zh_cn: 答案明显是“是的，你应该”。

source: The argument type (optional), enclosed in {}, the argument name, and a short description (with a space in between)
zh_cn: 由{}括起来的参数类型（可选）、参数名以及简短描述（之间用空格断开）

source: The asset category will be set to 'Demo' on upload
zh_cn: 上传时物品类别将设置为“Demo”

source: The asset category will be set to 'Demos' on upload
zh_cn: 上传时资源类别将设置为“Demo”

source: The asset category will be set to 'Tutorial' on upload
zh_cn: 上传时物品类别将设置为“教程”

source: The asset category will be set to 'Tutorials' on upload
zh_cn: 上传时资源类别将设置为“教程”

source: The asset layer simply takes a sprite resource and draws it using the paramters that you set when you add it into the room.
zh_cn: 资源层只需要精灵资源，并使用您在将其添加到房间时设置的参数来进行绘制。

source: The available anti-aliasing levels are 0,2,4 and 8, with the default startup value being set to 0, and the default v-sync setting is false (off).
zh_cn: 可用的抗锯齿等级包括0、2、4和8，默认起动时设置为0，默认的 v-sync（垂直同步）设置为关闭 (假)。

source: The available options are:
zh_cn: 可用的选项有：

source: The background colour that should be shown behind animation frames
zh_cn: 应在动画帧后面显示的背景颜色

source: The background colour that should be shown behind autotiling tiles
zh_cn: 自动图块背后应该显示的背景色

source: The background layer is a layer that can be filled with a single colour or a single image.
zh_cn: 背景层是可以用 单一 颜色或 单个 图像填充的层。

source: The basic idea of the path resource is rather simple - you define a path by drawing it in the path editor, then you can place an action (or code) in an event of an object to tell the object to follow that particular path in the game room.
zh_cn: 路径资源的基本思路很简单-你可以通过在路径编辑器中绘制路径来对路径资源进行定义，然后你可以通过在物体的事件中放置动作模块或者添加代码来使物体在房间中沿着特定路径（来行动）。

source: The basic use of a surface would be as follows - You first create a surface and assign its index to a variable.
zh_cn: 表面层的基本用法如下 - 首先创建一个表面，给它的索引分配给一个变量。

source: The batch is "broken" when you change a font, a colour, a blend mode, or any other draw status that affects how things are drawn on a global scale, so you should try to limit these things to as few objects as possible since a high number of batches will adversely affect your games performance.
zh_cn: 当您更改字体，颜色，混合模式或影响全局绘制效果的任何其他绘图状态时，该批次将被“破坏”，因此您应该尝试将这些行为尽可能限制，否则批次数太大将对您的游戏性能产生不利影响。

source: The binary calculations that are of interest to us, and of great use, are multiplication and division.
zh_cn: 我们对于二进制计算的乘法和除法显然更感兴趣，并且用处更大。

source: The bits we shift down are simply lost.
zh_cn: 我们右移的位丢失了。

source: The bottom edge of the rectangle to check.
zh_cn: 矩形的底部边界。The bottom edge of the rectangle to check.

source: The bottom position of the region of cells to copy from the source grid.
zh_cn: 从源栅格复制的单元格区域的底端位置

source: The buffer id is an integer value starting at zero and increments when a new buffer is created.\nView the contents of the buffer with a given id.
zh_cn: 缓冲区id是一个从零开始的整数值，在创建新的缓冲区时递增。\n使用给定的id查看缓冲区的内容。

source: The buffer method to use (see the constants list below).
zh_cn: 准备使用的缓冲区方法（查看下面所列的常量）。

source: The build menu is where you can choose to build your project either for testing, debugging or as a final executable.
zh_cn: 构建菜单那里你可以选择构建你的项目，要么测试，要么调试，或者一个最终的可执行文件。

source: The built in argument variables can only be used inside a script but you have tried to use them elsewhere (for more information on scripts and arguments see here)
zh_cn: 内置的 参数 变量只能在脚本中使用，但你尝试在其他地方使用它们（有关脚本和参数的更多信息，请参阅 这里）

source: The call stack is empty.
zh_cn: 调用栈为空。

source: The certificate form consists of the following sections for when you have already created a certificate:
zh_cn: 当你已经创建一个证书的时候，证书表单由下面的部分组成：

source: The chain link alpha at the the falloff stop distance
zh_cn: 在衰减停止距离的链条连杆透明度

source: The choices are:
zh_cn: 选项有：

source: The chosen directory must be empty
zh_cn: 所选目录必须为空

source: The code below gives a simple example of this:
zh_cn: 下面的代码给出了一个简单的例子：

source: The collision mask is the area that GameMaker Studio 2 will check to see if there has been a collision, and by default this is set to rectangle (which is also the fastest to resolve).
zh_cn: 碰撞盒是 GameMaker Studio 2 检查是否发生碰撞的区域，默认情况下设置为 矩形 （这也是最快的解决办法）。

source: The colour applied to active anchor points
zh_cn: 用于活动锚点的颜色

source: The colour applied to active invalid anchor points
zh_cn: 用于无效活动锚点的颜色

source: The colour applied to an invalid anchor
zh_cn: 用于无效锚点的颜色

source: The colour applied to an invalid path
zh_cn: 用于无效路径的颜色

source: The colour applied to anchor points
zh_cn: 用于锚点的颜色

source: The colour applied to highlighted anchor points
zh_cn: 用于高亮锚点的颜色

source: The colour applied to highlighted path segments
zh_cn: 用于高亮路径段的颜色

source: The colour applied to invalid highlighted anchor points
zh_cn: 用于无效高亮锚点的有难色

source: The colour applied to the mask overlay
zh_cn: 颜色应用到蒙版覆盖

source: The colour applied to the path
zh_cn: 用于路径的颜色

source: The colour for the default background layer added to new rooms
zh_cn: 添加到新房间的默认背景层的颜色

source: The colour of the inteliesense text up to the current point
zh_cn: 智能提示文本中到当前点的颜色（状态栏中）

source: The colour of the intellisense text left
zh_cn: 智能提示文本左边的颜色（状态栏中）

source: The colour to check
zh_cn: 待检查的颜色

source: The colour to set the region.
zh_cn: 颜色，用于设置那块区域。

source: The colour with which the screen will be cleared
zh_cn: 用来填充屏幕的颜色

source: The comments themselves need to be given an identifier (preceded by "@") and content, and the available identifiers are as follows:
zh_cn: 这种注释本身需要一个标识符（以"@"打头）及其内容，其中可供使用的标识符如下所示：

source: The compiler does not recognise the function or script being called
zh_cn: 编译器不能识别被调用的函数或脚本

source: The configuration name '{0}' is not valid
zh_cn: 配置名称 '{0}' 无效

source: The constants available are:
zh_cn: 可用的常量如下：

source: The contents of this list will vary depending on the licence that you have, but will always have at least the "Test" target.
zh_cn: 此列表的内容取决于您拥有的许可证，至少会有“测试”目标平台。

source: The core of your game will be created from assets added to the resource tree.
zh_cn: 游戏的核心将通过资源创建并被添加到资源树中。

source: The current platform is not supported on this Remote Worker.
zh_cn: 此远程工作者不支持当前平台。

source: The current projection matrix
zh_cn: 当前的投影矩阵

source: The current runtime ({0}) is lower than the baseline required ({1}).\nPlease update your runtime to {1} or higher.
zh_cn: 当前运行库 ({0})版本低于所要求的基准版本({1})。\n请将您的运行库更新为{1}或更高版本。

source: The current view matrix
zh_cn: 当前的视野矩阵

source: The current world matrix
zh_cn: 当前的世界矩阵

source: The cursor to set for the game window.
zh_cn: 为游戏窗口设置的光标。.

source: The data package to send to your game (a string)
zh_cn: 发送到游戏的数据包 (字符串格式)

source: The data string to be uploaded.
zh_cn: 将要被上传的字符串。

source: The date/time to fire the off the notification
zh_cn: 触发通知的日期/时间。

source: The debug output would be 1 and 3.
zh_cn: 调试输出将会有1和3。

source: The default action here is to show a warning message asking if you want to continue, but you can set this to "Okay" and the dialog will not be shown before the conversion.
zh_cn: 这里默认的动作是如果你想继续会显示一个警告信息，但是你可以设置为“确定（Okay）”，然后在转换前这个对话框将不会显示。

source: The default action here is to show a warning message, but you can set this to "Okay" and the dialog will not be shown.
zh_cn: 这里默认的动作是显示警告信息，但是你可以设置“确定（Okay）”让对话框不显示。

source: The default colour is (rgba) #808080FF.
zh_cn: 默认颜色为（rgba）#808080FF。

source: The default colour is black ($00000000).
zh_cn: 默认为黑色（$00000000）。

source: The default colour is white ($ffffff).
zh_cn: 默认颜色为白色($ffffff)。

source: The default height for new sprites
zh_cn: 新的精灵的默认高度

source: The default height of a new room
zh_cn: 新房间的默认高度

source: The default is rectangle.
zh_cn: 默认是矩形。

source: The default is set to 8.
zh_cn: 默认值为8。

source: The default is to have this option checked.
zh_cn: 该选项默认勾选。

source: The default is to show a warning message but you can set this option to "OK" to suppress the message and continue, without adding any resources.
zh_cn: 默认是显示警告信息但是你可以设置这个选项为“确定（Ok）”来禁止显消息并继续，而不添加任何资源。

source: The default is to show you a warning message and let you decide what to do, but you can set it to "Delete All" to suppress the message and go ahead with the item delete from the parent room and all its children, or you can select "Keep All" to suppress the message abort the delete.
zh_cn: 默认是显示一个警告消息，让你决定要做什么，但是你可以设置为“删除所有（Delete All）”来禁止这个消息，并继续从父房间和它所有的子房间删除这个项目，或者你可以选择“保留所有（Keep All）”来禁止消息并中止删除。

source: The default is to show you a warning message and let you decide what to do, but you can set it to "Delete All" to suppress the message and go ahead with the layer delete from the parent room and all its children, or you can select "Keep All" to suppress the message abort the delete.
zh_cn: 默认情况是给你显示一条警告消息让你决定做什么，但是你可以设置它为“删除所有（Delete All）”来禁止消息并继续从父房间和它所有的子房间删除这个层，或者你可以选择“保留所有（Keep All）”来禁止消息并中止删除。

source: The default setting is "Show Message".
zh_cn: 默认设置为“显示消息”。

source: The default size of the Toolbox action thumbnails.
zh_cn: 工具栏动作缩略图的默认尺寸

source: The default speed of a new room in frames per second (FPS)
zh_cn: 新房间的默认速度（帧每秒，FPS）

source: The default value here is "loop".
zh_cn: 此处默认值为“循环”（Loop）

source: The default value here is to have no path.
zh_cn: 此处默认值为无路径。

source: The default value is "Show Message".
zh_cn: 默认值为“显示消息”。

source: The default value is (rgba) #FFFFFF30.
zh_cn: 默认值是（rgba）#FFFFFF30。

source: The default value is 0 (0 or less is essentially infinite) and any other value will limit the lines permitted.
zh_cn: 默认值是0（0或者更小表示不限），任何其它值将限制允许的行数。

source: The default value is 1.
zh_cn: 默认值为1。

source: The default value is 100%.
zh_cn: 默认值为100％。

source: The default value is 100, so each layer will be previous layer + 100 in depth.
zh_cn: 默认值是100，所以每一层的深度将是前一层的深度加100。

source: The default value is 1px.
zh_cn: 默认值为1像素。

source: The default value is 20.
zh_cn: 默认值为20.

source: The default value is 20px.
zh_cn: 默认值为20px（20像素）。

source: The default value is 30px.
zh_cn: 默认值为30px（30像素）。

source: The default value is 40.
zh_cn: 默认值为40.

source: The default value is 40°.
zh_cn: 默认值为40° ###为方便理解本条目可能需要补一张图###

source: The default value is 500ms.
zh_cn: 默认值为500毫秒

source: The default value is 51268.
zh_cn: 默认值为51268

source: The default value is 51291.
zh_cn: 默认值为 51291。

source: The default value is 6509.
zh_cn: 默认值为6509。

source: The default value is 8 and in general you shouldn't have to change this, but if you are on a laptop or a lower end machine you may want to lower this value.
zh_cn: 默认值为8，通常你不需要更改这个值，但是如果你在笔记本电脑或低配电脑上可能希望降低这个值。

source: The default value is #282828FF.
zh_cn: 默认值为#282828FF.

source: The default value is on, making view boundaries visible when you open a room.
zh_cn: 默认值是打开，使打开房间时视野边界可见。

source: The default value is the Top Left.
zh_cn: 默认值是左上（Top Left）。

source: The default value is to have "Show Message".
zh_cn: 默认值为“显示消息”

source: The default value of each is $FFFFFFFF.
zh_cn: 每个选项的默认值为$ FFFFFFFF。

source: The default view is the standard resource tree layout outlined above, but you have two options for creating new views depending on what you require:
zh_cn: 默认视图是上面列出的标准资源树布局，但是有两个选项可以让您根据需要来创建新视图。

source: The default width for new sprites
zh_cn: 新的精灵的默认宽度

source: The default width of a new room
zh_cn: 新房间的默认宽度

source: The density of something is defined as its mass per unit volume, which basically means how much mass is crammed into the space it takes up in the world.
zh_cn: 某物的密度定义为其每单位体积的质量<i>，这基本上意味着在世界所占据的空间中有多少质量被挤压。

source: The device is being held horizontally ie: The longest edge is from left to right, and the menu button is on the right.
zh_cn: 横向放置设备，如： 拥有从左到右最长的边缘，菜单按钮是在右边。

source: The device is being held vertically ie: The longest edge is from top to bottom, and the menu button is at the bottom.
zh_cn: 纵向放置设备 如：从顶部到底拥有最长的边缘，菜单在底部。

# The device with serial id: {0} requires authorisation. Please check the device.
source: The device with serial id: {0} requires authorisation.\nPlease check the device.
zh_cn: 序列id为{0}的设备需要授权。\n请检查设备。

source: The devices.json is locked.\nPlease ensure no other application is trying to read or write to this and try again.
zh_cn: devices.json 被锁住了。\n请确保没有其他应用程序在尝试读写这个文件并重试。

source: The difference now is that the events that the child has added (step and draw) will override the ones in the parent event.
zh_cn: 现在的区别是，孩子添加的事件（步骤和绘制）将覆盖父事件中的事件。

source: The different buttons below these options permit you to choose what to so and how to perform the search.
zh_cn: 这些选项下面的不同按钮允许您选择搜索什么以及如何进行搜索。

source: The different options available are listed below along with a description of what each one does.
zh_cn: 下面列举了各种可用选项及每一个的描述。

source: The different target compilers will perform the operations in different orders since they are not explicitly shown, giving rise to "odd" results that you may not expect when you play your game.
zh_cn: 不同平台的编译器用不同的顺序执行运算，如果没有明确体现，可能会导致得出一个奇怪的结果，而影响游戏的体验。

source: The distance in pixels that the chain alpha begins to fade out
zh_cn: 链条透明度开始淡出的像素距离

source: The distance in pixels that the chain alpha stops fading out
zh_cn: 链条透明度停止淡出的像素距离

source: The door would have a single "bit" assigned like so door_id=1 (0001), another with door_id=2 (0010), door_id=4 (0100),door_id=8 (1000) and so on.
zh_cn: 门用一个“位”分配，例如 door_id = 1(0001)、door_id = 2(0010)、door_id = 4(0100)、door_id = 8(1000) 等等。

source: The draw alpha affects the transparency of all draw functions, and can be set with the draw_set_alpha function.
zh_cn: 这个绘制透明度会影响所有的绘制函数，你可以使用 draw_set_alpha 函数来修改它。

source: The draw gui begin event.
zh_cn: 绘制GUI开始事件

source: The draw gui end event.
zh_cn: 绘制GUI结束事件

source: The draw gui event.
zh_cn: 绘制GUI事件

source: The drawing target is then set to the new surface, which is cleared and made transparent before having the drawing target reset to the display.
zh_cn: 然后绘制目标设置给这个新的表面图层，接下来是清除表面，设置为透明，再是将绘制目标设置给显示器。

source: The ds_map will hold the following key/value pairs:
zh_cn: ds_map 将包含以下的键值对儿（key/value pairs）：

source: The easiest way to find this is to go to the Temp folder (typically located at %localappdata%\Temp\GameMakerStudio\<game_name>\) and just search for *.win, as that will show you all those available and you can simply pick that which you need to get the full path from.
zh_cn: 最简单的方法是去 Temp 文件夹（通常位于 %localappdata%\Temp\GameMakerStudio\<游戏名>\），然后搜索 *.win，这将显示所有可用项，然后你可以选择你需要的文件获取完整路径。

source: The edit menu is where you can use the general edition tools of the GameMaker Studio 2 interface.
zh_cn: 在编辑菜单中你可以使用GameMaker Studio 2界面的一些常规编辑工具。

source: The enmu entry does no evaluate as an integer constant (see here for more information on Enums)
zh_cn: 枚举条目不作为整数常量计算（有关枚举的更多信息，请参阅 这里）

source: The entry of the array to get the length of.
zh_cn: 待获取数组长度的数组元素。

source: The enum entries can only be real numbers or expressions with previous enums, and by default are numbered from 0 upwards, so our example given above would default to red = 0, orange = 1, yellow = 2, etc...
zh_cn: 枚举的项目只可以是实数或包含前面枚举的表达式，并且默认地数字从0开始向上走，因此我们上面所给的例子会默认red = 0orange = 1yellow = 2等……

source: The enum has an invalid entry (see here for more information on Enums)
zh_cn: 枚举有一条无效条目（有关枚举的更多信息，请参阅 这里）

source: The enum number is invalid for the enum (see here for more information on Enums)
zh_cn: 枚举数对枚举无效（有关枚举的更多信息，请参阅 这里）

source: The event is still being copied.
zh_cn: 事件仍然被复制。
